### Definição de DataFrame: é um objeto bi-dimensional que contem dados em forma tabular, ou seja, é como se fosse uma tabela do Excel, que é possível adicionar linhas e colunas

In [1]:
import pandas as pd

In [2]:
# Criando DataFrame
df1 = pd.DataFrame ()

In [3]:
df1

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df1)

pandas.core.frame.DataFrame

In [5]:
# importacia de dicionarias
dict1 = {'Identificacao': [1,2,3,4,5],
         'Nome':['Leandro', 'Dulcinea','Theo','Thor','Clarice']}

In [6]:
dict1

{'Identificacao': [1, 2, 3, 4, 5],
 'Nome': ['Leandro', 'Dulcinea', 'Theo', 'Thor', 'Clarice']}

In [7]:
df2 = pd.DataFrame(data= dict1)

In [8]:
df2

   Identificacao      Nome
0              1   Leandro
1              2  Dulcinea
2              3      Theo
3              4      Thor
4              5   Clarice

In [9]:
df3 = pd.DataFrame(data= dict1, index=[29,1,0,2222,88])

In [10]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

In [11]:
serie1 = pd.Series([1,2,3])

In [12]:
serie1

0    1
1    2
2    3
dtype: int64

In [13]:
type(serie1)

pandas.core.series.Series

In [14]:
serie2 = pd.Series(['a','b','c'])

In [15]:
serie2

0    a
1    b
2    c
dtype: object

In [16]:
df4 = pd.DataFrame({'coluna1':serie1,
                   'coluna2': serie2})

In [17]:
df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c

#### Meu treino

In [18]:
Nome_Famila = {'Nome': ['Leandro', 'Dulci','Theo'],
               'Eu souza': ['Pai','Mãe','Filho']}

In [19]:
df_famila = pd.DataFrame(data= Nome_Famila, index=['Marido', 'Esposa','Bebe'])

In [20]:
df_famila

           Nome Eu souza
Marido  Leandro      Pai
Esposa    Dulci      Mãe
Bebe       Theo    Filho

Final de treino

In [21]:
import numpy as np

In [22]:
array1 = np.array([[1,2,3],
                   ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
                   ['SP','RJ','SP']])

In [23]:
array1

array([['1', '2', '3'],
       ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
       ['SP', 'RJ', 'SP']], dtype='<U14')

In [24]:
type(array1)

numpy.ndarray

In [25]:
df5 = pd.DataFrame(data= array1.transpose(), 
                   index=['linha1','linha2','linha3'],
                   columns =['Identificação','Cidade','Estado'])

In [26]:
df5

       Identificação          Cidade Estado
linha1             1       Sao Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP

In [27]:
matriz1 = np.matrix([[1,2,3],
                   ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
                   ['SP','RJ','SP']])

### Selecionando DataFrame

In [28]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

In [31]:
tabela_csv = pd.read_csv("produtos.csv")

In [32]:
display(tabela_csv)

,codigo,marca,tipo,categoria,preco_unitario,custo,obs
0,MOLO000251,Logitech,Mouse,1,25.95,6.5,NaN
1,MOLO000192,Logitech,Mouse,2,19.95,5.0,NaN
2,CAHA000251,Hashtag,Camisa,1,25.00,11.0,NaN
3,CAHA000252,Hashtag,Camisa,2,25.00,11.0,Conferir estoque
4,MOMU000111,Multilaser,Mouse,1,11.99,3.4,NaN
...,...,...,...,...,...,...,...
288,ACAP000192,Apple,Acessorios,2,19.00,3.8,NaN
289,ACSA0009.3,Samsung,Acessorios,3,9.55,2.1,NaN
290,CEMO000271,Motorola,Celular,1,279.00,72.5,NaN
291,FOMO000152,Motorola,Fone,2,150.00,33.0,NaN
292,CEMO000223,Motorola,Celular,3,229.00,55.0,NaN